/**********************************************
 * 
 * 10.
 * designate.c
 * 使用指定初始化器
 * 
 ***********************************************/

#include <stdio.h>

#define MONTHS 12

int main(void){
    int days[MONTHS] = {31, 28, [4] = 31, 30, 31, [1] = 29};
    int i;

    for (i = 0; i < MONTHS; ++i)
        printf("%2d %d\n", i+1, days[i]);
    
    return 0;
}

/**********************************************
 * 
 * 程序输出：
 *  1 31
 *  2 29        这里为29而不是一开始的28
 *  3 0         未赋值的地方默认0
 *  4 0         
 *  5 31        指定初始化
 *  6 30        指定初始化后面依次赋值
 *  7 31
 *  8 0
 *  9 0
 * 10 0
 * 11 0
 * 12 0
 *
 ***********************************************/